using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using FairyGUI;
namespace app{
public partial class DriveScene : MonoBehaviour
{
    private string[] strs = {
        "乘客您好，已从您的私人工作AI处获得您的目的地，请核实：", // strs[0]
        "点击目的地",
        "目的地：乌镇中医私人诊所。",
        "请将您的后背靠近座椅，安全带自动系上后，车辆将开始行驶",
        "车辆行驶中…",
        "已到达乌镇中医诊所，祝您出行愉快，感谢您使用滴滴无人驾驶服务。",
        "剧情跳转：第二章", // strs[6]
        "乘客您好，已从您的私人工作AI处获得您的目的地，请核实：", // strs[7]
        "点击目的地",
        "目的地：XGP理工大学。",
        "请将您的后背靠近座椅，安全带自动系上后，车辆将开始行驶",
        "车辆行驶中…",
        "已到达XGP理工大学，祝您出行愉快，感谢您使用滴滴无人驾驶服务。",
        "[进行跳转]", // strs[13]
        "获取历史订单数据，已启动返程服务。", // strs[14]
        "已到达陶夕工作室，祝您出行愉快，感谢您使用滴滴无人驾驶服务。",
        "[中转章]", // strs[16]
        "获取历史订单数据，已启动返程服务。", // strs[17]
        "已到达陶夕工作室，祝您出行愉快，感谢您使用滴滴无人驾驶服务。",
        "[结束了]" // strs[19]
    };
}
}